dsgt-soap/requestaddveganorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:mealName>Vegan Burger</gs:mealName>
            <gs:quantity>2</gs:quantity>
            <gs:orderDate>2024-04-01T12:00:00</gs:orderDate>
            <gs:customer>John Doe</gs:customer>
            <gs:address>123 Main St, Springfield, IL 62701</gs:address>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>